"""
7. Реализовать генератор с помощью функции с ключевым словом yield,
создающим очередное значение. При вызове функции должен создаваться объект-генератор.
Функция должна вызываться следующим образом: for el in fact(n).
Функция отвечает за получение факториала числа, а в цикле необходимо
выводить только первые n чисел, начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n.
Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

"""
from functools import reduce

def fact(N):
    for i in range(1, N + 1):
        list1 = list(range(i, 0, -1))
        ans = reduce(lambda x, y: x * y, list1)
        yield ans

print("Введите число")
n = int(input())
for el in fact(n):
    print(el)
